[
  {
    "image": "https://i.ibb.co.com/7Jgz3cbr/facebook.png",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 1,
    "description": "Facebook is one of the world’s largest social networking platforms where you can connect with friends, family, and people from around the globe. It allows you to share updates, photos, and videos, express yourself through posts and stories, join interest-based groups, follow pages, and discover local events. With Facebook Marketplace, you can also buy and sell items, and through Facebook Watch, you can enjoy videos and live streams from creators and influencers. It’s a complete digital space for social interaction, entertainment, and community building.",
    "size": "120MB",
    "reviews": 5000000,
    "ratingAvg": 4.2,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 2600000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/bgr9MZS7/messenger.png",
    "title": "Messenger",
    "companyName": "Meta Platforms, Inc.",
    "id": 2,
    "description": "Messenger is Meta’s instant messaging app that helps you stay connected with friends and family in real time. You can send text messages, photos, videos, voice notes, and make high-quality voice and video calls anywhere in the world. Messenger also supports group chats, stickers, emojis, reactions, and message customization options. With features like vanish mode, secret conversations, and cross-app chatting with Instagram users, Messenger offers both fun and privacy-focused communication in one platform.",
    "size": "100MB",
    "reviews": 3000000,
    "ratingAvg": 4.3,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Instagram_icon.png",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 3,
    "description": "Instagram is a popular social media platform for sharing photos, videos, and stories with your followers. It allows you to express creativity through reels, explore trending content, and connect with friends or favorite creators. The app also includes direct messaging, live streaming, and shopping features where you can discover and buy products from brands you love. With powerful editing tools, filters, and an engaging feed, Instagram has become the go-to app for digital lifestyle, inspiration, and content creation.",
    "size": "150MB",
    "reviews": 4000000,
    "ratingAvg": 4.5,
    "downloads": "2B",
    "ratings": [
      { "name": "1 star", "count": 250000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 350000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 2050000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ZpTpRQPC/tiktok.png",
    "title": "TikTok",
    "companyName": "ByteDance",
    "id": 4,
    "description": "TikTok is a short-form video platform where users can create, watch, and share entertaining videos ranging from 15 seconds to several minutes. It offers powerful editing tools, sound effects, and filters to make creative and engaging content. From dance challenges to tutorials, comedy, and storytelling, TikTok allows everyone to become a creator. The app’s personalized ‘For You’ feed recommends trending videos based on your interests, making it one of the most engaging and viral social media platforms globally.",
    "size": "80MB",
    "reviews": 6000000,
    "ratingAvg": 4.7,
    "downloads": "3B",
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 3200000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
    "title": "WhatsApp",
    "companyName": "Meta Platforms, Inc.",
    "id": 5,
    "description": "WhatsApp is a fast, reliable, and secure messaging app used by billions of people worldwide. It allows you to send text messages, photos, videos, and voice messages instantly, along with high-quality audio and video calls. With features like group chats, WhatsApp Web, end-to-end encryption, and disappearing messages, it ensures privacy and convenience. WhatsApp Business also helps small businesses communicate with customers easily and manage their online presence professionally.",
    "size": "120MB",
    "reviews": 7000000,
    "ratingAvg": 4.6,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 200000 },
      { "name": "3 star", "count": 600000 },
      { "name": "4 star", "count": 2200000 },
      { "name": "5 star", "count": 3600000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/MkbcSzkQ/snapchat.png",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 6,
    "description": "Snapchat is a multimedia messaging app where you can send photos and videos called 'snaps' that disappear after being viewed. It offers creative filters, Bitmojis, AR lenses, and stories for sharing moments with friends. You can also explore Discover for exclusive content from creators and publishers, and use Snap Map to see where your friends are. With new features like Spotlight and Chat AI, Snapchat is a fun, fast, and visual way to stay connected.",
    "size": "90MB",
    "reviews": 2500000,
    "ratingAvg": 4.1,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 600000 },
      { "name": "5 star", "count": 1600000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/mFYqpmVc/spotify.png",
    "title": "Spotify",
    "companyName": "Spotify Ltd.",
    "id": 7,
    "description": "Spotify is a leading music and podcast streaming platform that gives you access to millions of songs and shows from artists all over the world. You can create playlists, follow your favorite musicians, and enjoy personalized recommendations based on your taste. Spotify also offers offline downloads, lyrics display, and high-quality sound in its Premium plan. Whether you’re chilling, studying, or working out, Spotify has the perfect soundtrack for every mood.",
    "size": "110MB",
    "reviews": 3500000,
    "ratingAvg": 4.5,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 200000 },
      { "name": "2 star", "count": 100000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1000000 },
      { "name": "5 star", "count": 2100000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/h11mTHZF/youtube.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 8,
    "description": "YouTube is the world’s largest video-sharing platform, where users can watch, upload, and share videos of all kinds. From tutorials and educational content to entertainment, music, vlogs, and live streams, YouTube caters to a global audience. Users can subscribe to channels, comment on videos, create playlists, and explore trending or personalized content. YouTube also offers YouTube Premium for ad-free viewing, offline downloads, and background play, making it a versatile platform for learning, entertainment, and community engagement.",
    "size": "150MB",
    "reviews": 5000000,
    "ratingAvg": 4.6,
    "downloads": "5B",
    "ratings": [
      { "name": "1 star", "count": 300000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 500000 },
      { "name": "4 star", "count": 1700000 },
      { "name": "5 star", "count": 2800000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/PzfrXkLf/D.jpg",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 9,
    "description": "Discord is a communication platform designed for creating communities, gaming groups, and social interaction. Users can chat via text, voice, or video, join servers based on their interests, and participate in discussions in organized channels. Discord supports screen sharing, live streaming, and integration with other apps, making it ideal for both casual conversation and professional collaboration. It’s widely used by gamers, hobbyists, and creators to build strong, interactive communities worldwide.",
    "size": "90MB",
    "reviews": 4200000,
    "ratingAvg": 4.7,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 80000 },
      { "name": "2 star", "count": 40000 },
      { "name": "3 star", "count": 180000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 2700000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/kgrGkXxR/T.png",
    "title": "Tinder",
    "companyName": "Tinder Inc.",
    "id": 10,
    "description": "Tinder is a popular dating app that allows users to swipe through profiles to find matches nearby or globally. With intuitive swipe features, you can like or pass on other users’ profiles and chat instantly with matches. Tinder also offers premium features such as Passport to match with people anywhere, Boost to increase profile visibility, and Super Likes to express special interest. It’s a fast, interactive, and convenient way to meet new people and explore potential relationships.",
    "size": "80MB",
    "reviews": 3800000,
    "ratingAvg": 4.3,
    "downloads": "400M",
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 50000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 1000000 },
      { "name": "5 star", "count": 2500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/d0Mr8st9/tweeter.png",
    "title": "Twitter",
    "companyName": "Twitter Inc.",
    "id": 11,
    "description": "Twitter is a microblogging and social networking platform where users can post short messages called tweets, follow topics, and engage in global conversations. It allows sharing text, images, videos, polls, and links, as well as retweeting and liking posts. Twitter is widely used for news, updates, networking, and discussions on trending topics. Verified accounts and lists help users filter content, while Twitter Spaces provides live audio conversation opportunities, making it a dynamic platform for engagement and information sharing.",
    "size": "85MB",
    "reviews": 5000000,
    "ratingAvg": 4.4,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 150000 },
      { "name": "2 star", "count": 70000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 1800000 },
      { "name": "5 star", "count": 2700000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Sw49JsCt/telegram.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 12,
    "description": "Telegram is a cloud-based messaging app known for speed, security, and privacy. Users can send messages, share photos, videos, files of any type, and create large group chats or broadcast channels. Telegram supports bots, stickers, animated GIFs, and secret chats with end-to-end encryption. Its cross-platform capability ensures seamless messaging across devices. With features like polls, scheduled messages, and supergroups, Telegram serves both personal communication and professional community needs efficiently.",
    "size": "70MB",
    "reviews": 4200000,
    "ratingAvg": 4.6,
    "downloads": "700M",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 2700000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/Kz8G1PmN/slack.png",
    "title": "Slack",
    "companyName": "Slack Technologies",
    "id": 13,
    "description": "Slack is a professional team communication and collaboration platform that simplifies workplace interactions. It provides channels for organizing discussions, direct messaging, file sharing, integrations with productivity tools, and workflow automation. Slack also supports video and voice calls, searchable archives, and notifications tailored to your needs. Widely used by companies, remote teams, and project groups, Slack enhances efficiency, coordination, and transparency in professional communication.",
    "size": "95MB",
    "reviews": 2500000,
    "ratingAvg": 4.5,
    "downloads": "200M",
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 1600000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/r27Rg6hg/L.png",
    "title": "LinkedIn",
    "companyName": "Microsoft",
    "id": 14,
    "description": "LinkedIn is the world’s largest professional networking platform, connecting professionals across industries. Users can create profiles, showcase experience and skills, connect with colleagues, join groups, follow companies, and apply for jobs. LinkedIn also offers LinkedIn Learning for skill development and insights, content sharing for thought leadership, and networking opportunities for career growth. It’s a powerful platform for building professional relationships, staying updated with industry trends, and enhancing employability.",
    "size": "100MB",
    "reviews": 3000000,
    "ratingAvg": 4.4,
    "downloads": "700M",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 25000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 2000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/VWkFJbgN/pinterest.png",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "id": 15,
    "description": "Pinterest is a visual discovery and bookmarking platform where users can find ideas, save inspirations, and organize collections. You can browse categories such as home decor, fashion, recipes, travel, and DIY projects. Users can create boards, pin images or videos, and follow other users or brands to get personalized recommendations. Pinterest acts as a creative hub for planning, learning new skills, or finding lifestyle inspiration, making it both fun and practical for daily use.",
    "size": "80MB",
    "reviews": 2000000,
    "ratingAvg": 4.3,
    "downloads": "400M",
    "ratings": [
      { "name": "1 star", "count": 30000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 80000 },
      { "name": "4 star", "count": 600000 },
      { "name": "5 star", "count": 1400000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/ymPR27kk/reddit.jpg",
    "title": "Reddit",
    "companyName": "Reddit Inc.",
    "id": 16,
    "description": "Reddit is a social news aggregation and discussion platform where users can join communities (subreddits) based on interests. You can post content, comment, vote on posts, and participate in discussions ranging from news, hobbies, entertainment, to niche topics. Reddit also provides live discussions, AMAs (Ask Me Anything), and trending content feeds. Its community-driven environment allows for sharing knowledge, opinions, and entertainment, making it a vibrant space for information exchange and social interaction.",
    "size": "75MB",
    "reviews": 2500000,
    "ratingAvg": 4.5,
    "downloads": "430M",
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 90000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 1600000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/BKCryFqN/caapcut.png",
    "title": "CapCut",
    "companyName": "ByteDance",
    "id": 17,
    "description": "CapCut is a powerful and user-friendly video editing app that lets you create professional-quality videos directly from your mobile device. It offers a wide range of editing tools including trimming, splitting, transitions, effects, filters, stickers, text, and music overlays. CapCut also supports keyframe animation, speed adjustment, and multi-layer editing for complex projects. Ideal for social media content creation, it allows users to produce eye-catching videos for platforms like TikTok, Instagram, and YouTube effortlessly.",
    "size": "120MB",
    "reviews": 3000000,
    "ratingAvg": 4.7,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 30000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 900000 },
      { "name": "5 star", "count": 2000000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/KxnM70r5/kakaotalk.png",
    "title": "KakaoTalk",
    "companyName": "Kakao Corp.",
    "id": 18,
    "description": "KakaoTalk is a free messaging app widely used for instant communication, offering text messages, voice and video calls, and multimedia sharing. It supports group chats, emoji and sticker packs, plus file sharing for documents, photos, and videos. KakaoTalk also provides features like scheduling, polls, and chat customization to enhance user experience. Popular in South Korea and internationally, it serves both personal and professional communication needs, combining convenience, fun, and security in a single app.",
    "size": "60MB",
    "reviews": 2000000,
    "ratingAvg": 4.3,
    "downloads": "300M",
    "ratings": [
      { "name": "1 star", "count": 20000 },
      { "name": "2 star", "count": 10000 },
      { "name": "3 star", "count": 50000 },
      { "name": "4 star", "count": 400000 },
      { "name": "5 star", "count": 1500000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/qL0WT3RC/netflixjpg.jpg",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 19,
    "description": "Netflix is a leading streaming service that offers a vast library of movies, TV shows, documentaries, and original content available on-demand. Users can watch across multiple devices, create personalized profiles, and enjoy recommendations based on viewing history. Netflix provides high-definition and 4K streaming, offline downloads, and a family-friendly interface. From popular series to award-winning films and exclusive originals, it delivers entertainment anytime, anywhere for diverse audiences worldwide.",
    "size": "140MB",
    "reviews": 4000000,
    "ratingAvg": 4.6,
    "downloads": "1B",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 25000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 2200000 }
    ]
  },
  {
    "image": "https://i.ibb.co.com/cXTCBxf8/zoom.jpg",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "id": 20,
    "description": "Zoom is a video conferencing and communication platform that enables users to host and join online meetings, webinars, and virtual events with ease. It supports high-quality video and audio, screen sharing, breakout rooms, and interactive features such as polls and chat. Zoom integrates with calendar systems and productivity tools for scheduling and collaboration. Trusted by businesses, educators, and individuals globally, it provides a reliable, scalable, and secure environment for remote work, online learning, and social connection.",
    "size": "130MB",
    "reviews": 3500000,
    "ratingAvg": 4.5,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 40000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 100000 },
      { "name": "4 star", "count": 800000 },
      { "name": "5 star", "count": 1600000 }
    ]
  }
]

